export default [
    {
    exam: `1．20世纪80年代以来，软件工程的主要特征可概括为
        A．主要研究系统实现技术
        B．关注软件质量和软件工程管理
        C．开发了若干过程式语言
        D．以软件复用技术为基础开展一系列软件生产技术
        2．根据软件需求分类，下列选项中不属于设计约束的是
        A．通信接口	B．法规政策
        C．审计功能	D．握手协议
        3．一个模块直接修改另一个模块的内部数据，这样的耦合被称为
        A．内容耦合	B．控制耦合
        C．公共耦合	D．数据耦合
        4．几种常见的内聚类型中，最理想的内聚是
        A．逻辑内聚	B．顺序内聚
        C．功能内聚	D．过程内聚
        5．对软件结构宽度影响最大的因素是模块的
        A．扇入	B．扇出
        C．深度	D．控制域
        6．下列工具中，常用在需求分析阶段的是
        A．HIPO图	B．N—S图
        C．PAD图	D．DFD图
        7．UML表达关系的术语中，聚合是一种特殊的
        A．关联	B．依赖
        C．泛化	D．细化
        8．UML用来表达系统功能模型的图形化工具是
        A．用况图	B．状态图
        C．类图	D．顺序图
        9．根据RUP实现活动，输入为设计类、接口，活动为实现类，则输出为
        A．用况	B．构件
        C．接口	D．子系统
        10．白盒测试技术依据的是
        A．程序的逻辑结构	B．程序的物理结构
        C．软件行为的描述	D．软件功能的描述
        11．从测试完成程度来看，下列选项中测试覆盖率最低的是
        A．分支覆盖	B．语句覆盖
        C．路径覆盖	D．条件组合覆盖
        12．对一个软件工程来说，占总工作量百分比重最大的工作是
        A．系统分析	B．软件设计
        C．编码工作	D．软件测试
        13．软件开发的增量模型是一种
        A．适用于需求被清晰定义的项目	B．快速构造产品第一版本的好方法
        C．适合于大型团队迭代开发的模式	D．支持面向对象技术的创新模型
        14．相对于螺旋模型，瀑布模型缺少
        A．制定计划	B．客户评估
        C．实施工程	D．风险分析
        15．CMMI能力等级中的第三级为
        A．已执行级	B．已管理级
        C．已定义级	D．已定量管理级`,
    answer: 'DAACBDAABABDBDC',
    },
    {
        exam: `1．在软件开发领域中，“描述了系统是什么”的系统模型被称为
A．设计模型	B．概念模型
C．实现模型	D．部署模型
2．下列选项不属于质量属性规约所期望的指标是
A．可靠性	B．可维护性
C．用户友好性	D．保密性
3．在常见的耦合类型中，应尽量避免使用的是
A．内容耦合	B．数据耦合
C．控制耦合	D．标记耦合
4．下列工具中，常用作总体设计的是
A．HIPO图	B．N-S图
C．PAD图	D．DFD图
5．UML表达关系的术语中，伴随限定符使用的关系是
A．关联	B．依赖
C．泛化	D．细化
6．自行车是一种交通工具，自行车和交通工具之间的关系是
A．组合	B．关联
C．依赖	D．泛化
7．面向对象分析中，对象模型描述了系统的
A．静态结构	B．动态结构
C．控制结构	D．顺序结构
8．UML用来表达系统交互建模的图形化工具是
A．用况图	B．状态图
C．顺序图	D．类图
9．根据RUP实现活动，输入为设计类，活动为实现类，则输出为
A．用况	B．构件
C．接口	D．子系统
10．黑盒测试技术依据的是
A．程序的逻辑结构	B．程序的物理结构
C．软件行为的描述	D．软件功能的描述
11．从测试完成程度来看，下列选项中测试覆盖率最高的是
A．语句覆盖	B．分支覆盖
C．条件组合覆盖	D．路径覆盖
12．一个程序只有一个输入S，其取值范围是－60≤S≤60。现从输入的角度设计了一组测试数据：-200，20，200，设计这组测试用例的方法是
A．条件覆盖	B．等价类划分
C．边界值分析	D．因果图
13．演化模型不具有的特性是
A．本质上是迭代的	B．容易适应变化的需求
C．有效风险控制机制	D．常常弱化需求分析
14．按照《ISO／IEC软件生存周期过程12207-1995》中，可归于组织过程的是
A．文档过程	B．验证过程
C．维护过程	D．管理过程
15．在CMMI能力等级中，共用目标最强的是
A．已执行级	B．持续优化级
C．已定义级	D．已定量管理级`,
        answer: 'BDAAADACBCDBCDB'
    },
    {
        exam: `1．以下哪一项不是软件危机的表现    【   】
  A．开发的软件可维护性差	B．软件极易被盗版    
C．经费预算经常被突破	D．开发的软件不能满足用户需求
2．以下哪个软件生存周期模型是一种风险驱动的模型              【   】
A．瀑布模型	B．增量模型    
C．螺旋模型	D．喷泉模型  
3．各种需求分析方法都有共同适用的    【   】
A．分析方法	B．说明方法   
C．表示方法	D．基本原则    
4．结构化分析建立功能模型的工具是   【   】
   A．DFD	B．判定树/判定表 
 C．DD	D．结构化语言
5．模块中所有成分结合起来完成一项任务，该模块的内聚性是   【   】
A．功能内聚	B．顺序内聚    
C．通信内聚	D．逻辑内聚       
6．系统定义明确之后，应对系统的可行性进行研究，可行性研究应包括        【   】
   A．技术可行性、经济可行性、社会可行性	B．经济可行性、安全可行性、操作可行性    
   C．经济可行性、社会可行性、系统可行性	D．经济可行性、实用件、社会可行性
7．以下哪一项对模块耦合性没有影响  【   】
   A．模块间接口的复杂程度	B．调用模块的方式    
   C．通过接口的信息	D．模块内部各个元素彼此之间的紧密结合程度
8．检查软件产品是否符合需求定义的过程称为   【   】
 A．确认测试	B．集成测试    
C．系统测试	D．单元测试    
9．下面关于详细设计的叙述中，错误的是    【   】
   A．程序流程图可以描述结构在藉序	B．程序流程图不能描述结构化程序    
   C．NS图描述的程序一定是结构化的	D．PAD图描述的程序一定是结构化的
10．在整个软件维护阶段所花费的全部工作中，所占比例最大的是    【    】
A．校正性维护	B．适应性维护    
C．完善性维护	D．预防性维护  
11．以下不属于序言性注释的有    【    】
    A．模块设计者	B．修改日期    
    C．程序的整体说明	D．语句功能
12．集成测试是为了发现    【    】
    A．接口错误	B．编码错误    
    C．性能、质量不合要求	D．功能错误
13．一个只有顺序结构的程序；其环形复杂度是   【   】
A．0	B．1    
C．3	D．5   
14．结构化程序设计，主要强调的是    【   】
    A．程序的执行效率	B．模块的内聚    
    C．程序的可理解性	D．模块的耦合
15．下面关于文档的叙述，错误的是    【    】’
    A．文档是仅用于说明使用软件的操作命令，不包括软件设计和实现细节	B．文档是软件产品的一部分，没有文档的软件就不成为软件
    C．高质量文档对于转让、变更、修改、扩充和使用有重要的意义	D．软件文档的编制在软件开发工作中占有突出的地位和相当大的工作量
16．在McCall软件质量度量模型中，面向软件产品操作的质量因素是    【    】
A．正确性	B．可维护性   
C．适应性	D．互操作性
17．对度量法，叙述错误的是   【   】
    A．度量法是一种基于程序控制流的复杂性度量法	B．度量法以图论为工具，用图的环路数作为程序复杂性的度量值
    C．度量法不能区分简单IF语句和循环语句的复杂性	D．度量法对模块间的接口和简单IF语句区分对待
18．在快速原型模型的开发过程中．仅用于代替设计阶段的原型是    【    】
A．探索型模型	B．演化型模型    
C．实验型模型	D．提交型模型
19．对于构造原型的建议，下面说法错误的是    【   】
    A．暂不考虑错误恢复和处理，但应考虑速度、空间等性能效率方面的要求	B．可降低可靠性和软件质量标准
    C．原型界面部分的设计，最好能与最终系统的界面相容	D．根据不同的软件类型和应用领域，可使用不同风格的高级语言来构造原型
20．面向对象开发方法中，将在面向对象技术领域内占主导地位的标准建模语言是【    】
    A．Booth方法	B．Coad方法
    C．UML语言	D．OMT方法`,
        answer: 'BCDBAADABCDABCAADCAC'
    },
    {
        exam:  `1．在软件生存周期中，时间最长的阶段是（      ）
A．需求分析	B．详细设计
C．编码	D.维护
2．以下最适合于面向对象的软件开发的软件生存周期模型是（      ）
A．瀑布模型	B.增量模型
C．螺旋模型	D.喷泉模型
3．以下不适用于需求分析的工具是（      ）
A．数据流图	B.判定表
C．PAD图	D.数据字典
4．以下几种模块内聚类型中，内聚性最低的是（      ）
A．时间内聚	B.逻辑内聚
C．顺序内聚	D．功能内聚
5．系统流程图中   符号的名称是（      ）
A．联机存储	B.处理
C．磁盘	D.文档
6．数据流图中的每个加工至少有（      ）
A．一个输入流或一个输出流	B.一个输出流
C．一个输入流	D.一个输入流和一个输出流
7．HIPO图是软件工程中的一种描述工具，采用HIPO图进行描述的阶段是（      ）
A．可行性分析	B.需求分析
C．概要设计	D.详细设计
8．Jackson方法是软件开发过程中常用的方法，使用Jackson方法可以实现（      ）
A．从数据结构导出程序结构	B.从数据流图导出初始结构图
C．从模块结构导出数据结构	D.从模块结构导出程序结构
9．过程设计语言(PDL)，又称为（      ）
A．伪码	B.高级程序设计语言
C．中级程序语言	D.低级程序设计语言
10．单元测试阶段主要涉及的文档为（      ）
A．需求设计	B.编码和详细设计
C．详细设计	D．概要设计
11．软件维护会产生副作用，下面选项中不属于维护副作用的是（      ）
A．编码副作用	B.测试副作用
C．文档副作用	D.数据副作用
l2．以下不适合作为科学工程计算的语言是（      ）
A．Pascal	B.C
C．Fortran	D.Prolog
l3．PAD图为下列哪个方面提供了有力的工具（      ）
A．系统分析	B．软件的自动化生成
C．自动分析数据	D.测试软件
14．结构化软件设计是（      ）
A．面向数据结构的	B.面向数据库的
C．面向数据流的	D.面向对象设计的
15．在McCall软件质量度量模型中，面向软件产品修改的质量因素为（      ）
A．可用性	B.完整性
C．适应性	D.互操作性
16．汽车是一种交通工具，汽车类和交通工具类之间的关系是（      ）
A．一般具体	B.has a
C．整体部分	D.组成
l7．Westinghouse公司于1992年公布了l3类软件工具分类标准和该类的范例工具以及例子，下面说法错误的是（      ）
A．代码生成程序属于编码和单元测试工具
B.桌面出版系统属于文档工具
C．数据库管理系统属于需求追踪工具
D.计划和进度属于项目管理工具
18．对McCabe度量法，叙述错误的是（      ）
A.McCabe度量法是一种基于程序控制流的复杂性度量法
B.McCabe度量法以图论为工具，用图的环路作为程序复杂性的度量值
C.McCabe度量法将简单IF语句和赋值语句的复杂性同等看待
D.McCabe复杂性度量也称为环路度量
19．瀑布模型本质是一种（      ）
A．顺序迭代模型	B.线性顺序模型
C．线性迭代模型	D.非线性模型
20．对于使用原型的建议，下面说法错误的是（      ）
A．开发周期很长的项目，可通过原型开发来缩短开发周期
B.系统的使用可能变化较大，不能相对稳定，而原型模型具有适应变化的机制
C．缺乏开发工具，或对原型的可用工具不了解的时候宜使用原型
D.用户对系统的需求较为模糊，对某种要求缺乏信心时宜使用原型`,
answer: 'DDCBADCAABBDCACAACBC'
    },
    {
        exam: `1.“软件工程的概念是为解决软件危机而提出的”这句话的意思是（     ）
A.强调软件工程成功解决了软件危机的问题
B.说明软件危机的存在总是使软件开发不像传统工程项目那样容易管理
C.说明软件工程这门学科的形成是软件发展的需要
D.说明软件工程的概念，即：工程的原则、思想、方法可解决当时软件开发和维护存在的问题
2.瀑布模型的主要特点是（     ）
A.将开发过程严格地划分为一系列有序的活动
B.将开发过程分解为阶段
C.提供了有效的管理模式
D.缺乏灵活性
3.在软件工程的需求分析阶段，不属于问题识别内容的是（     ）
A.功能需求	B.性能需求
C.环境需求	D.输入／输出需求
4.画某系统的数据流图时，顶层图有（     ）
A.0张	B.1张
C.2张	D.3张及其以上
5.软件模块内聚性最强的是（     ）
A.功能内聚	B.通信内聚
C.偶然内聚	D.逻辑内聚
6.最早提出软件系统维护问题的阶段是（     ）
A.可行性分析	B.需求分析
C.概要设计	D.详细设计
7.SD（结构化设计）方法设计的结果是（     ）
A.模块	B.模块结构图
C.模块的算法	D.数据流图
8.在进行软件测试时，首先应当进行以下哪项测试，然后再进行组装测试，最后再进行有效性测试（     ）
A.单元测试	B.系统测试
C.集成测试	D.确认测试
9.软件详细设计阶段的任务是（     ）
A.算法与数据结构设计	B.功能设计
C.调用关系设计	D.输入／输出设计
10.下列属于静态测试方法的是（     ）
A.黑盒法	B.路径覆盖
C.白盒法	D.人工检测
11.Fortran语言主要作为以下哪个方面的语言（     ）
A.科学工程计算	B.系统软件
C.事务处理	D.人工智能
12.用结构化语言来描述加工逻辑的外层结构时，以下不属于基本结构的是（     ）
A.顺序结构	B.选择结构
C.嵌套结构	D.重复结构
l3.可维护软件的主要特性包括（     ）
A.可理解性、可修改性、可移植性
B.可使用性
C.可维护性、可使用性、可靠性
D.可测试性
14.程序设计语言不具有的特性是（     ）
A.心理特性	B.工程特性
C.应用特性	D.技术特性
15.下列不属于项目进度安排主要方法的是（     ）
A.工程网络图	B.Gantt图
C.进度结构图	D.任务资源表
16.下列不属于通常冗余技术的是（     ）
A.结构冗余	B.信息冗余
C.时间冗余	D.代码冗余
17.下列工具中，属于需求追踪工具的是（     ）
A.在DBMS上的应用运行工具	B.追踪和状态报告
C.访问和版本控制机构	D.文件和修改管理
18.关于软件测试的目的，下面观点错误的是（     ）
A.为了发现错误而执行程序的过程
B.一个好的测试用例能够发现至今尚未发现的错误
C.证明程序是正确、没有错误的
D.一个成功的测试用例是发现了至今尚未发现的错误的测试
19.在制定项目开发计划文档时，不包含的内容是（     ）
A.项目概述	B.实施计划
C.测试计划	D.交付期限
20.面向对象的开发方法中，以下哪种方法原是面向Ada语言的，并处于面向对象开发方法的奠基性地位（     ）
A.Booch方法	B.Coad方法
C.UML语言	D.OMT方法`,
answer: 'CADBDBBAADACACCDACCA'
    }
];
