export default [
	[
		{
			exam: `1．20世纪80年代以来，软件工程的主要特征可概括为
        A．主要研究系统实现技术
        B．关注软件质量和软件工程管理
        C．开发了若干过程式语言
        D．以软件复用技术为基础开展一系列软件生产技术
        2．根据软件需求分类，下列选项中不属于设计约束的是
        A．通信接口	B．法规政策
        C．审计功能	D．握手协议
        3．一个模块直接修改另一个模块的内部数据，这样的耦合被称为
        A．内容耦合	B．控制耦合
        C．公共耦合	D．数据耦合
        4．几种常见的内聚类型中，最理想的内聚是
        A．逻辑内聚	B．顺序内聚
        C．功能内聚	D．过程内聚
        5．对软件结构宽度影响最大的因素是模块的
        A．扇入	B．扇出
        C．深度	D．控制域
        6．下列工具中，常用在需求分析阶段的是
        A．HIPO图	B．N—S图
        C．PAD图	D．DFD图
        7．UML表达关系的术语中，聚合是一种特殊的
        A．关联	B．依赖
        C．泛化	D．细化
        8．UML用来表达系统功能模型的图形化工具是
        A．用况图	B．状态图
        C．类图	D．顺序图
        9．根据RUP实现活动，输入为设计类、接口，活动为实现类，则输出为
        A．用况	B．构件
        C．接口	D．子系统
        10．白盒测试技术依据的是
        A．程序的逻辑结构	B．程序的物理结构
        C．软件行为的描述	D．软件功能的描述
        11．从测试完成程度来看，下列选项中测试覆盖率最低的是
        A．分支覆盖	B．语句覆盖
        C．路径覆盖	D．条件组合覆盖
        12．对一个软件工程来说，占总工作量百分比重最大的工作是
        A．系统分析	B．软件设计
        C．编码工作	D．软件测试
        13．软件开发的增量模型是一种
        A．适用于需求被清晰定义的项目	B．快速构造产品第一版本的好方法
        C．适合于大型团队迭代开发的模式	D．支持面向对象技术的创新模型
        14．相对于螺旋模型，瀑布模型缺少
        A．制定计划	B．客户评估
        C．实施工程	D．风险分析
        15．CMMI能力等级中的第三级为
        A．已执行级	B．已管理级
        C．已定义级	D．已定量管理级`,
			answer: 'DAACBDAABABDBDC',
		},
		{
			exam: `1．在软件开发领域中，“描述了系统是什么”的系统模型被称为
A．设计模型	B．概念模型
C．实现模型	D．部署模型
2．下列选项不属于质量属性规约所期望的指标是
A．可靠性	B．可维护性
C．用户友好性	D．保密性
3．在常见的耦合类型中，应尽量避免使用的是
A．内容耦合	B．数据耦合
C．控制耦合	D．标记耦合
4．下列工具中，常用作总体设计的是
A．HIPO图	B．N-S图
C．PAD图	D．DFD图
5．UML表达关系的术语中，伴随限定符使用的关系是
A．关联	B．依赖
C．泛化	D．细化
6．自行车是一种交通工具，自行车和交通工具之间的关系是
A．组合	B．关联
C．依赖	D．泛化
7．面向对象分析中，对象模型描述了系统的
A．静态结构	B．动态结构
C．控制结构	D．顺序结构
8．UML用来表达系统交互建模的图形化工具是
A．用况图	B．状态图
C．顺序图	D．类图
9．根据RUP实现活动，输入为设计类，活动为实现类，则输出为
A．用况	B．构件
C．接口	D．子系统
10．黑盒测试技术依据的是
A．程序的逻辑结构	B．程序的物理结构
C．软件行为的描述	D．软件功能的描述
11．从测试完成程度来看，下列选项中测试覆盖率最高的是
A．语句覆盖	B．分支覆盖
C．条件组合覆盖	D．路径覆盖
12．一个程序只有一个输入S，其取值范围是－60≤S≤60。现从输入的角度设计了一组测试数据：-200，20，200，设计这组测试用例的方法是
A．条件覆盖	B．等价类划分
C．边界值分析	D．因果图
13．演化模型不具有的特性是
A．本质上是迭代的	B．容易适应变化的需求
C．有效风险控制机制	D．常常弱化需求分析
14．按照《ISO／IEC软件生存周期过程12207-1995》中，可归于组织过程的是
A．文档过程	B．验证过程
C．维护过程	D．管理过程
15．在CMMI能力等级中，共用目标最强的是
A．已执行级	B．持续优化级
C．已定义级	D．已定量管理级`,
			answer: 'BDAAADACBCDBCDB'
		},
		{
			exam: `1．以下哪一项不是软件危机的表现  
  A．开发的软件可维护性差	B．软件极易被盗版    
C．经费预算经常被突破	D．开发的软件不能满足用户需求
2．以下哪个软件生存周期模型是一种风险驱动的模型            
A．瀑布模型	B．增量模型    
C．螺旋模型	D．喷泉模型  
3．各种需求分析方法都有共同适用的  
A．分析方法	B．说明方法   
C．表示方法	D．基本原则    
4．结构化分析建立功能模型的工具是 
   A．DFD	B．判定树/判定表 
 C．DD	D．结构化语言
5．模块中所有成分结合起来完成一项任务，该模块的内聚性是 
A．功能内聚	B．顺序内聚    
C．通信内聚	D．逻辑内聚       
6．系统定义明确之后，应对系统的可行性进行研究，可行性研究应包括      
   A．技术可行性、经济可行性、社会可行性	B．经济可行性、安全可行性、操作可行性    
   C．经济可行性、社会可行性、系统可行性	D．经济可行性、实用件、社会可行性
7．以下哪一项对模块耦合性没有影响
   A．模块间接口的复杂程度	B．调用模块的方式    
   C．通过接口的信息	D．模块内部各个元素彼此之间的紧密结合程度
8．检查软件产品是否符合需求定义的过程称为 
 A．确认测试	B．集成测试    
C．系统测试	D．单元测试    
9．下面关于详细设计的叙述中，错误的是  
   A．程序流程图可以描述结构在藉序	B．程序流程图不能描述结构化程序    
   C．NS图描述的程序一定是结构化的	D．PAD图描述的程序一定是结构化的
10．在整个软件维护阶段所花费的全部工作中，所占比例最大的是    
A．校正性维护	B．适应性维护    
C．完善性维护	D．预防性维护  
11．以下不属于序言性注释的有    
    A．模块设计者	B．修改日期    
    C．程序的整体说明	D．语句功能
12．集成测试是为了发现    
    A．接口错误	B．编码错误    
    C．性能、质量不合要求	D．功能错误
13．一个只有顺序结构的程序；其环形复杂度是 
A．0	B．1    
C．3	D．5   
14．结构化程序设计，主要强调的是  
    A．程序的执行效率	B．模块的内聚    
    C．程序的可理解性	D．模块的耦合
15．下面关于文档的叙述，错误的是
    A．文档是仅用于说明使用软件的操作命令，不包括软件设计和实现细节	B．文档是软件产品的一部分，没有文档的软件就不成为软件
    C．高质量文档对于转让、变更、修改、扩充和使用有重要的意义	D．软件文档的编制在软件开发工作中占有突出的地位和相当大的工作量
16．在McCall软件质量度量模型中，面向软件产品操作的质量因素是    
A．正确性	B．可维护性   
C．适应性	D．互操作性
17．对度量法，叙述错误的是 
    A．度量法是一种基于程序控制流的复杂性度量法	B．度量法以图论为工具，用图的环路数作为程序复杂性的度量值
    C．度量法不能区分简单IF语句和循环语句的复杂性	D．度量法对模块间的接口和简单IF语句区分对待
18．在快速原型模型的开发过程中．仅用于代替设计阶段的原型是    
A．探索型模型	B．演化型模型    
C．实验型模型	D．提交型模型
19．对于构造原型的建议，下面说法错误的是  
    A．暂不考虑错误恢复和处理，但应考虑速度、空间等性能效率方面的要求	B．可降低可靠性和软件质量标准
    C．原型界面部分的设计，最好能与最终系统的界面相容	D．根据不同的软件类型和应用领域，可使用不同风格的高级语言来构造原型
20．面向对象开发方法中，将在面向对象技术领域内占主导地位的标准建模语言是
    A．Booth方法	B．Coad方法
    C．UML语言	D．OMT方法`,
			answer: 'BCDBAADABCDABCAADCAC'
		},
		{
			exam: `1．在软件生存周期中，时间最长的阶段是
A．需求分析	B．详细设计
C．编码	D.维护
2．以下最适合于面向对象的软件开发的软件生存周期模型是
A．瀑布模型	B.增量模型
C．螺旋模型	D.喷泉模型
3．以下不适用于需求分析的工具是
A．数据流图	B.判定表
C．PAD图	D.数据字典
4．以下几种模块内聚类型中，内聚性最低的是
A．时间内聚	B.逻辑内聚
C．顺序内聚	D．功能内聚
5．系统流程图中符号的名称是
A．联机存储	B.处理
C．磁盘	D.文档
6．数据流图中的每个加工至少有
A．一个输入流或一个输出流	B.一个输出流
C．一个输入流	D.一个输入流和一个输出流
7．HIPO图是软件工程中的一种描述工具，采用HIPO图进行描述的阶段是
A．可行性分析	B.需求分析
C．概要设计	D.详细设计
8．Jackson方法是软件开发过程中常用的方法，使用Jackson方法可以实现
A．从数据结构导出程序结构	B.从数据流图导出初始结构图
C．从模块结构导出数据结构	D.从模块结构导出程序结构
9．过程设计语言(PDL)，又称为
A．伪码	B.高级程序设计语言
C．中级程序语言	D.低级程序设计语言
10．单元测试阶段主要涉及的文档为
A．需求设计	B.编码和详细设计
C．详细设计	D．概要设计
11．软件维护会产生副作用，下面选项中不属于维护副作用的是
A．编码副作用	B.测试副作用
C．文档副作用	D.数据副作用
l2．以下不适合作为科学工程计算的语言是
A．Pascal	B.C
C．Fortran	D.Prolog
l3．PAD图为下列哪个方面提供了有力的工具
A．系统分析	B．软件的自动化生成
C．自动分析数据	D.测试软件
14．结构化软件设计是
A．面向数据结构的	B.面向数据库的
C．面向数据流的	D.面向对象设计的
15．在McCall软件质量度量模型中，面向软件产品修改的质量因素为
A．可用性	B.完整性
C．适应性	D.互操作性
16．汽车是一种交通工具，汽车类和交通工具类之间的关系是
A．一般具体	B.has-a
C．整体部分	D.组成
l7．Westinghouse公司于1992年公布了l3类软件工具分类标准和该类的范例工具以及例子，下面说法错误的是
A．代码生成程序属于编码和单元测试工具
B.桌面出版系统属于文档工具
C．数据库管理系统属于需求追踪工具
D.计划和进度属于项目管理工具
18．对McCabe度量法，叙述错误的是
A.McCabe度量法是一种基于程序控制流的复杂性度量法
B.McCabe度量法以图论为工具，用图的环路作为程序复杂性的度量值
C.McCabe度量法将简单IF语句和赋值语句的复杂性同等看待
D.McCabe复杂性度量也称为环路度量
19．瀑布模型本质是一种
A．顺序迭代模型	B.线性顺序模型
C．线性迭代模型	D.非线性模型
20．对于使用原型的建议，下面说法错误的是
A．开发周期很长的项目，可通过原型开发来缩短开发周期
B.系统的使用可能变化较大，不能相对稳定，而原型模型具有适应变化的机制
C．缺乏开发工具，或对原型的可用工具不了解的时候宜使用原型
D.用户对系统的需求较为模糊，对某种要求缺乏信心时宜使用原型`,
			answer: 'DDCBADCAABBDCACAACBC'
		},
		{
			exam: `1.“软件工程的概念是为解决软件危机而提出的”这句话的意思是
A.强调软件工程成功解决了软件危机的问题
B.说明软件危机的存在总是使软件开发不像传统工程项目那样容易管理
C.说明软件工程这门学科的形成是软件发展的需要
D.说明软件工程的概念，即：工程的原则、思想、方法可解决当时软件开发和维护存在的问题
2.瀑布模型的主要特点是
A.将开发过程严格地划分为一系列有序的活动
B.将开发过程分解为阶段
C.提供了有效的管理模式
D.缺乏灵活性
3.在软件工程的需求分析阶段，不属于问题识别内容的是
A.功能需求	B.性能需求
C.环境需求	D.输入／输出需求
4.画某系统的数据流图时，顶层图有
A.0张	B.1张
C.2张	D.3张及其以上
5.软件模块内聚性最强的是
A.功能内聚	B.通信内聚
C.偶然内聚	D.逻辑内聚
6.最早提出软件系统维护问题的阶段是
A.可行性分析	B.需求分析
C.概要设计	D.详细设计
7.SD（结构化设计）方法设计的结果是
A.模块	B.模块结构图
C.模块的算法	D.数据流图
8.在进行软件测试时，首先应当进行以下哪项测试，然后再进行组装测试，最后再进行有效性测试
A.单元测试	B.系统测试
C.集成测试	D.确认测试
9.软件详细设计阶段的任务是
A.算法与数据结构设计	B.功能设计
C.调用关系设计	D.输入／输出设计
10.下列属于静态测试方法的是
A.黑盒法	B.路径覆盖
C.白盒法	D.人工检测
11.Fortran语言主要作为以下哪个方面的语言
A.科学工程计算	B.系统软件
C.事务处理	D.人工智能
12.用结构化语言来描述加工逻辑的外层结构时，以下不属于基本结构的是
A.顺序结构	B.选择结构
C.嵌套结构	D.重复结构
l3.可维护软件的主要特性包括
A.可理解性、可修改性、可移植性
B.可使用性
C.可维护性、可使用性、可靠性
D.可测试性
14.程序设计语言不具有的特性是
A.心理特性	B.工程特性
C.应用特性	D.技术特性
15.下列不属于项目进度安排主要方法的是
A.工程网络图	B.Gantt图
C.进度结构图	D.任务资源表
16.下列不属于通常冗余技术的是
A.结构冗余	B.信息冗余
C.时间冗余	D.代码冗余
17.下列工具中，属于需求追踪工具的是
A.在DBMS上的应用运行工具	B.追踪和状态报告
C.访问和版本控制机构	D.文件和修改管理
18.关于软件测试的目的，下面观点错误的是
A.为了发现错误而执行程序的过程
B.一个好的测试用例能够发现至今尚未发现的错误
C.证明程序是正确、没有错误的
D.一个成功的测试用例是发现了至今尚未发现的错误的测试
19.在制定项目开发计划文档时，不包含的内容是
A.项目概述	B.实施计划
C.测试计划	D.交付期限
20.面向对象的开发方法中，以下哪种方法原是面向Ada语言的，并处于面向对象开发方法的奠基性地位
A.Booch方法	B.Coad方法
C.UML语言	D.OMT方法`,
			answer: 'CADBDBBAADACACCDACCA'
		}
	],
	[
		{
			exam: `1.鸦片战争前中国封建社会的主要矛盾是
A.地主阶段和农民阶级的矛盾	B.帝国主义和中华名族的矛盾
C.资产阶级和工人阶级的矛盾	D.封建主义和资本主义的矛盾
2.西方列强对中国的侵略，首先和主要的是
A.政治控制	B.军事侵略	C.经济掠夺	D.文化渗透
3.太平天国由盛转衰的转折点是
A.长沙战役	B.北伐受挫	C.天京事变	D.安庆失守
4.太平天国后期，洪仁轩提出的具有资本主义色彩的改革方案是。
A.《四洲志》	B.《海国图志》	C.《资政新篇》	D.《盛世危言》
5.洋务派创办的第一个规模较大的近代军事工业是。
A.江南制造总局	B.金陵机器局	C.马尾船政局	D.天津机器局
6.近代中国向西方派遣第一批留学生是在。
A.洋务运动时期		B.戊戌维新时期		C.清末"新政"时期	D.辛亥革命时期
7.在中国近代史上，资产阶级思想和封建主义思想的第一次正面交锋是。
A.洋务派与顽固派的论战					B.洋务派与维新派的论战
C.维新派与守旧派的论战					D.革命派与改良派的论战
8.19世纪90年代，梁启超宣传变法维新主张的著作是。
A.《新学伪经考》	B.《仁学》			C.《人类公理》		D.《变法通义》
9.1904年至1905年，为争夺在华利益而在中国东北进行战争的帝国主义国家是。
A.日本与俄国		B.美国与英国		C.英国与日本		D.美国与俄国
10.在1911年爆发的保路运动中，规模最大，斗争最激烈的省份是。
A.湖南				B.湖北				C.广东				D.四川
11.第一次国共合作的政治基础是。
A.三民主义			B.新三民主义		C.新民主主义		D.社会主义
12.1928年12月，在东北宣布"服从南京国民政府，改易旗帜"的是。
A.孙传芳			B.吴佩孚			C.张作霖			D.张学良
13.1935年，中国共产党提出建立抗日民族统一战线的会议是。
A.瓦窑堡会议					B.洛川会议
C.中共六届六中全会			D.中共六届七中全会
14.1936年10月，中国工农红军三大主力胜利会师地是。
A.四川懋功地区				B.甘肃会宁、静宁将台堡
C.西康甘孜地区				D.陕北吴起镇
15.抗日战争全面爆发后，中国军队取得第一次重大胜利的战役是。
A.平型关战役		B.台儿庄战役		C.百团大战			D.昆仑关战役
16.1941年3月，在大后方抗日民主运动中诞生的民主党派是
A.中国国民党临时行动委员会			B.中国民主政团同盟
C.中国民主促进会					D.中国民主建国会
17.1946年2月，国民党特务破坏“庆祝政协成功大会”所制造的惨案是
A.五卅惨案			B.确山惨案			C.校场口惨案		D.下关惨案
18.1951年底至1952年春，中国共产党在党政机构工作人员中开展的运动是
A.肃反运动			B.整风、整党运动	C.“三反”运动		D.“五反”运动
19.中国进入社会主义社会的主要标志是
A.中华人民共和国的成立					B.“一五”计划的制定
C.第一届全国人民代表大会的召开			D.社会主义三大改造的完成
20.1956年，在中共八大上提出“三个主体，三个补充”思想的是
A.周恩来			B.刘少奇			C.邓小平			D.陈云
21.毛泽东在1957年2月扩大的最高国务会议上指出，我国政治生活的主题是
A.正确处理敌我矛盾			B.正确处理人民内部矛盾
C.正确处理民主与专政的关系			D.正确处理共产党和民主党派的关系
22.1961年1月，中共中央决定对国民经济实行“调整、巩固、充实、提高”方针的会议是
A.中共八届五中全会				B.中共八届六中全会
C.中共八届九中全会				D.中共八届十中全会
23.1967年，老一辈无产阶级革命家与中央文革小组的错误做法进行的抗争被诬称为
A.“一月风暴”		B.“二月逆流”		C.“右倾翻案”		D.“反攻倒算”
24.新中国第一颗人造地球卫星的成功发射是在
A.1964年10月		B.1966年10月		C.1967年4月		D.1970年4月1970年4月
25.2001年，中国对外开放进入一个新阶段的标志是
A.加入世界贸易组织				B.设立海南经济特区
C.开发和开放上海浦东新区			D.开放十四个沿海港口城市`,
			answer: 'ABCCAACDADBDABABCCDDBCBDA'
		},
		{
			exam: `1．19世纪初，向中国大肆走私鸦片的主要国家是
    A．美国	B．英国
    C．日本	D．俄国
    2．将中国领土台湾割让给日本的不平等条约是
    A．《南京条约	B．《北京条约》
    C．《马关条约》	D．《瑷珲条约》
    3．基督教在中国设立的最大出版机构广学会发行的报刊是
    A．《中国丛报》	B．《北华捷报》
    C．《字林西报》	D．《万国公报》
    4．中国近代史上人民群众第一次大规模的反侵略武装斗争是
    A．三元里人民的抗英斗争	B．太平天国抗击洋枪队的斗争
    C．台湾人民的抗日斗争	D．义和团抗击八国联军的斗争
    5．鸦片战争后，提出“师夷长技以制夷”思想的是
    A．林则徐	B．王韬
    C．龚自珍	D．魏源
    6．1853年，太平天国定都天京后颁布的纲领性文件是
    A。《原道觉世训》	B．《十款天条》
    C．《天朝田亩制度》	D．《资政新篇》
  7．戊戌维新时期，维新派在上海创办的影响较大的报刊是
    A．《时务报》	B．《国闻报》
    C．《湘报》	D．《新民丛报》
  8．为反对袁世凯的独裁和卖国行径，孙中山在1913年领导革命党人发动了
    A．二次革命	B．护国战争
    C．护法战争	D．北伐战争
  9．1918年5月，鲁迅发表的第一篇白话文小说是
    A．《阿Q正传》	B．《狂人日记》
    C．《药》	D．《孔乙己》
10．中国近代史上第一次彻底反帝反封建的革命运动是
    A．辛亥革命	B．五四运动
    C．五卅运动	D．国民革命
11．1921年9月，中国共产党领导成立的第一个农民协会是在
    A．湖南省湘潭县	B．广东省海丰县
    C．浙江省萧山县	D．福建省上杭县
12．国民党在全国统治建立后，官僚资本的垄断活动首先和主要是
    A．从农业方面开始的	B．从重工业方面开始的
    C．从商业方面开始的	D．从金融业方面开始的
13．中国共产党独立领导革命战争和创建人民军队的开端是
    A．南昌起义	B．秋收起义
    C．平江起义	D．百色起义
14．1933年11月，国民党爱国将领蔡廷锴和蒋光鼐等发动的抗曰反蒋事件是
    A．宁都起义	B．福建事变
    C．西安事变	D．二二八起义
15．1946年6月，国民党军队挑起全面内战的起点是
    A．大举围攻中原解放区	B．大举围攻东北解放区
    C．重点进攻陕甘宁边区	D．重点进攻山东解放区
16．1948年9月，中国人民解放军发起战略决战的第一个战役是
    A．辽沈战役	B．淮海战役
    C．平津战役	D．渡江战役
17．1949年3月，中国共产党在河北省平山县西柏坡召开的重要会议是
    A．中共六大	B．中共六届六中全会
    C．中共七大	D．中共七届二中全会
18．新中国成立初期，社会主义国营经济建立的主要途径是
    A．征用外国资本	B．赎买民族资本
    C．没收官僚资本	D．合并公营资本
19．在探索中国社会主义建设道路过程中，提出社会主义社会基本矛盾学说的是
    A．刘少奇	B．毛泽东
    C．陈云	D．周恩来
20．新中国第一次正式提出实现“四个现代化”奋斗目标的会议是
    A．第一届全国人民代表大会	B．第二届全国人民代表大会
    C．第三届全国人民代表大会	D．第四届全国人民代表大会
21．邓小平在1979年3月的中央理论工作务虚会上明确提出，必须坚持
    A．“一个中国”的原则	B．“两手抓、两手都要硬”的方针
    C．四项基本原则	D．“三个有利于”的标准
22．1988年，中共中央和国务院决定建立的经济特区是
    A．海南经济特区	B．汕头经济特区
    C．厦门经济特区	D．珠海经济特区
23．中国共产党明确提出我国建立社会主义市场经济体制目标的会议是
    A．中共十三大	B．中共十四大
    C．中共十五大	D．中共十六大
24．2005年，第十届全国人民代表大会第三次会议通过的法律是
    A．《香港特别行政区基本法》	B．《澳门特别行政区基本法》
    C．《国家安全法》	D．《反分裂国家法》
25．中共十八大提出，我国到2020年的奋斗目标是
    A．实现“四个现代化”	B. 基本实现现代化
    C．全面建设小康社会	D．全面建成小康社会`,
			answer: 'BCDADCAABBCDABAADCBCCABDD'
		},
		{
			exam: `1．中国半殖民地半封建社会最主要的矛盾是
    A．地主阶级与农民阶级的矛盾	B．资产阶级与工人阶级的矛盾
    C．帝国主义与中华民族的矛盾	D．封建主义与人民大众的矛盾
2．洋务派最早从事的洋务事业是
    A．兴办军用工业		B．兴办民用工业
    C．派遣留学生	D．创立新式学堂
3．戊戌维新时期，维新派在上海创办的影响较大的报刊是
    A．《国闻报》	B．《时务报》	C．《强学报》	D．《万国公报》
4．1904年至l905年，为争夺侵略权益公然在中国东北进行战争的是
    A．美国与俄国	B．美国与英国
    C．英国与日本	D．日本与俄国
5．20世纪初，在资产阶级民主革命思想传播中发表《驳康有为论革命书》的是
A.孙中山	B．邹容
B.C．章炳麟	D．陈天华
6．1922年1月，中国共产党领导的第一次工人运动高潮的起点是
    A．香港海员罢工		B．安源路矿工人罢工
    C.京汉铁路工人罢工	D．省港工人罢工
7.1930年8月，邓演达领导成立的中间党派是
    A．中国青年党	B．中国国家社会党
    C．中国国民党临时行动委员会	D．中国国民党革命委员会
8．第五次反“围剿”斗争失败后，1934年10月开始战略转移的是
  A．红十五军团	B．红一方面军
  C．红二方面军	D．红四方面军
9．1935年，日本帝国主义为扩大对华侵略而发动的事变是
  A．九一八事变	B．一·二八事变
  C．华北事变	D．卢沟桥事变
10．1937年，在淞沪会战中率领“八百壮士”孤军据守四行仓库的爱国将领是
  A．谢晋元	B．佟麟阁
  C．张自忠	D．戴安澜
11．1940年，八路军对侵华日军发动大规模进攻的战役是
  A．平型关战役	B．雁门关战役
  C．阳明堡战役	D．百团大战
12．1945年8月至1O月，国共双方举行的谈判是
  A．西安谈判	B．重庆谈判
  C．南京谈判	D．北平谈判
13．1946年6月，国民党军队挑起全面内战的起点是
    A．大举围攻中原解放区	B．大举围攻东北解放区
    C．重点进攻陕甘宁边区	D．重点进攻山东解放区
14．台湾人民为反抗国民党当局暴政而举行“二二八”起义的时间是
    A．1945年	B．1946年
    C．1947年	D．1948年
15．新中国发展国民经济第一个五年计划的中心环节是
    A．优先发展轻工业	B．优先发展重工业
    C．重点发展农村经济	D．重点发展城市经济
16．1956年召开的中共八大指出，党和全国人民当前的主要任务是
  A．争取国家财政经济状况的根本好转	B．完成社会主义改造
  C．正确处理人民内部矛盾	D．把我国从落后的农业国变为先进的工业国
17．在中共八大上提出“三个主体，三个补充”思想的是
    A．陈云	B．刘少奇
    C．邓小平	D．周恩来
18．新中国第一次提出实现“四个现代化”奋斗目标的会议是
    A．第一届全国人民代表大会	B．第二届全国人民代表大会
    C．第三届全国人民代表大会	D．第四届全国人民代表大会
19．1967年，老一辈革命家与中央文革小组错误做法进行的抗争被诬称为
    A．“一月风暴”	B．“二月逆流”
    C．“右倾翻案”	D．“反攻倒算”
20．1970年，新中国在科学技术领域取得的重大成就是
    A．第一颗原子弹试验成功	B．第一颗氢弹试验成功
    C．第一颗中近程地地核导弹发射成功	D．第一颗人造卫星发射成功
21．邓小平在1979年3月的理论工作务虚会上明确提出，必须坚持
    A．“一个中国”的原则	B．“两手抓、两手都要硬”的方针
    C．“三个有利于”的标准	D．四项基本原则
22．中国共产党第一次明确概括社会主义初级阶段基本路线的会议是
    A．中共十二大	B．中共十三大
    C．中共十四大	D．中共十五大
23．中国对香港恢复行使主权的时间是
    A．1997年7月1日	B．1997年l2月20日
    C．1999年7月1日	D．1999年12月20日
24．2001年，中国对外开放进入一个新阶段的标志是
    A．开放十四个沿海港口城市	B．设立海南经济特区
    C．开发和开放上海浦东新区	D．加入世界贸易组织
25．2004年9月，中共十六届四中全会提出的战略任务是
    A．建立社会主义市场经济体制	B．全面建设小康社会
    C．建设社会主义新农村	D．构建社会主义和谐社会`,
			answer: 'CABDCACBCADBACBDACBDDBADD'
		},
		{
			exam: `1．1840年鸦片战争前，中国社会的性质是
A．奴隶社会                                 B．封建社会
C．半殖民地半封建社会                       D．资本主义社会
2．鸦片战争后，提出“师夷长技以制夷”思想的是
A．龚自珍            B．林则徐              C．魏源               D．王韬
3．洋务运动时期最早创办的翻译学堂是
A．同文馆            B．广方言馆            C．译书局             D．译书馆
4．1911年，在保路运动中规模最大、斗争最激烈的省份是
A．湖北              B．湖南                C．广东               D．四川
5．中国历史上第一部具有资产阶级共和国宪法性质的法典是
A．《中华民国临时约法》                      B．《钦定宪法大纲》
C．《中华民国约法》                          D．《中华民国宪法》
6．中国共产党第一次明确提出反帝反封建民主革命纲领的会议是
A．中共一大           B．中共二大           C．中共三大           D．中共四大
7．1927年国民党南京政权建立后，官僚资本的垄断活动首先和主要是从
A．金融业方面开始                           B．商业方面开始
C．轻工业方面开始                           D．重工业方面开始
8．1935年1月，中国共产党召开的具有历史转折意义的会议是
A．八七会议           B．古田会议           C．遵义会议           D．洛川会议
9．1933年11月，国民党爱国将领蔡廷锴和蒋光鼐发动的抗日反蒋事件是
A．宁都起义           B．福建事变           
C．西安事变           D．二二八起义
10．1938年l0月广州、武汉失守后，中国抗日战争进入的阶段是
A．战略防御阶段       B．战略相持阶段       
C．战略反攻阶段       D．战略决战阶段
11．1940年，八路军对华北日军发动大规模进攻的战役是
A．平型关战役         B．雁门关战役         C．阳明堡战役         D．百团大战
12．1945年8月，中共中央在《对目前时局的宣言》中明确提出的口号是
A．和平、民主、团结                         B．向北发展，向南防御
C．打倒蒋介石，解放全中国                   D．打过长江去，解放全中国
13．1951年底至1952年春，中国共产党在党政机关工作人员中开展的运动是
A．肃反运动           B．整风、整党运动     C．“三反”运动       D．“五反”运动
14．新中国成立初期，社会主义国营经济建立的主要途径是
A．合并公营资本       B．征用外国资本       C．赎买民族资本      D．没收官僚资本
15．我国对资本主义工商业进行社会主义改造的基本政策是
A．无偿没收           B．有偿征用           C．和平赎买          D．“四马分肥”
16．毛泽东在《论十大关系》中提出的中国社会主义建设的基本方针是
A．不要四面出击                             B．调整、巩固、充实、提高
C．调动一切积极因素为社会主义事业服务       D．积极引导、稳步前进
17．在中共八大上，陈云提出的重要思想是
A．双重监督                                 B．“三个主体，三个补充”
C．健全法制                                 D．“两条腿”走路
18．新中国第一次提出实现“四个现代化”奋斗目标的会议是
A．第一届全国人民代表大会                   B．第二届全国人民代表大会
C．第三届全国人民代表大会                   D．第四届全国人民代表大会
19．新中国第一颗人造地球卫星发射成功的时间是
A．1964年10月                              B．1966年10月
C．1967年10月                              D．1970年4月
20．1971年10月，新中国在外交上取得的重大成果是
A．恢复了在世界卫生组织的合法席位            B．恢复了在联合国的合法席位
C．实现了中日关系正常化                      D．实现了中法关系正常化
21．1984年，中共十二届三中全会通过的重要文件是
A．《关于加快农业发展若干问题的决定》         B．《关于经济体制改革的决定》
C．《关于科技体制改革的决定》                 D．《关于教育体制改革的决定》
22．1988年，中共中央和国务院决定建立的经济特区是
A．海南经济特区                              B．珠海经济特区
C．厦门经济特区                              D．深圳经济特区
23．1999年12月，中国在推进国家统一大业方面迈出的重要一步是
A．海峡两岸达成“九二共识”                  B．海峡两岸举行“汪辜会谈”
C．恢复对香港行使主权                        D．恢复对澳门行使主权
24．2004年9月，中共十六届四中全会提出的战略任务是
A．构建社会主义和谐社会                      B．全面建设小康社会
C．建设社会主义新农村                        D．建立社会主义市场经济体制
25．2005年3月，第十届全国人民代表大会第三次会议通过的法律是
A．《香港特别行政区基本法》                   B．《国家安全法》
C．《澳门特别行政区基本法》                   D．《反分裂国家法》`,
			answer: 'BCADABACBBDACDCCBCDBBADAD'
		},
		{
			exam: `1.旧民主主义革命时期，中国反侵略斗争失败的最根本原因是
A.社会制度腐败	    B.经济技术落后
C.思想文化保守	    D.军事装备落后
2.1853年，太平天国颁布的纲领性文件是
A.《原道觉世训》	    B.《十款天条》
C《天朝田亩制度》	D.《资政新篇》
3.19世纪90年代，梁启超宣传变法维新主张的著作是
A.《新学伪经考》	    B.《仁学》
C.《人类公理》	    D.《变法通义》
4.在中国近代史上，资产阶级思想与封建主义思想的第一次正面交锋是
A.洋务派与顽固派的论战	B.洋务派与维新派的论战
C.维新派与守旧派的论战	D.革命派与改良派的论战
5.1894年，孙中山在檀香山建立的中国第一个资产阶级革命组织是
A.兴中会		B.华兴会
C.光复会	D.岳王会
6.1905年至1907年，资产阶级革命派与改良派论战的焦点是
A.要不要打倒列强   	    B.要不要以革命手段推翻清政府
C.要不要实行共和	        D.要不要废科举，兴学堂
7.1911年4月，资产阶级革命派在黄兴带领下举行的起义是
A.惠州起义	B.河口起义
C.广州起义	D.武昌起义
8.中国历史上第一部具有资产阶级共和国宪法性质的法典是
A.《中华民国宪法》	B.《钦定宪法大纲》
C.《中华民国约法》	D.《中华民国临时约法》
9.为反对袁世凯刺杀宋教仁和“善后大借款”，孙中山在1913年领导革命党人发动了
A.二次革命	B.护国战争
C.护法战争	D.北伐战争
10.1918年5月，鲁迅发表的第一篇白话文小说是
A.《阿Q正传》	    B.《狂人日记》
C.《药》	            D.《祝福》
11.1920年11月，中国共产党早期组织领导建立的第一个产业工会是
A.上海机器工会	    B.上海印刷工会
C.上海纺织工会	    D.中华全国总工会
12.1930年1月，毛泽东提出以乡村为中心思想的重要著作是
A.《井冈山的斗争》	B.《星星之火，可以燎原》
C.《反对本本主义》	D.《中国革命和中国共产党》
13.1933年5月，国民党西北军将领冯玉祥领导成立的抗日武装力量是
A.东北抗日义勇军	    B.察哈尔抗日同盟军
C.东北抗日联军	    D.冀中回民支队
14.1938年3月，国民党军队在抗日战争正面战场取得胜利的战役是
A.平型关战役	        B.桂南战役
C.台儿庄战役	        D.枣宜战役
15.1937年8月，中国共产党制定《抗日救国十大纲领》的重要会议是
A.瓦窑堡会议	        B.洛川会议
C.中共六届六中全会	D.中共六届七中全会
16.1947年，台湾人民举行的反对国民党反动统治的大规模斗争是
A.黑旗军起义	        B.—二•一运动
C.二二八起义	        D.—二•三〇运动
17.中国共产党在过渡时期总路线的主体是实现
A.国家的社会主义工业化
B.国家对农业的社会主义改造
C.国家对手工业的社会主义改造
D.国家对资本主义工商业的社会主义改造
18.在我国农业合作化过程中，具有半社会主义性质的经济组织形式是
A.变工队	            B.互助组
C.初级农业生产合作社	D.高级农业生产合作社
19.1956年召开的中共八大指出，党和全国人民当前的主要任务是
A.争取国家财政经济状况的根本好转
B.正确处理人民内部矛盾
C.把我国从落后的农业国变为先进的工业国
D.实现社会主义四个现代化
20.1962年初，中共中央为统一思想、总结经验教训和明确工作方向而召开的会议是
A.南宁会议	B.武昌会议
C.庐山会议	D.“七千人大会”
21.邓小平在1979年3月的中央理论工作务虚会上明确提出，必须坚持
A.“一个中国”的原则	B.“两手抓、两手都要硬”的方针
C.四项基本原则	        D.“三个有利于”的标准
22.1988年，中共中央和国务院决定建立的经济特区是
A.珠海经济特区	B.汕头经济特区
C.厦门经济特区	D.海南经济特区
23.1999年12月20日，中国在推进祖国统一大业方面迈出的重要一步是
A.海峡两岸达成“九二共识”	B.海峡双边举行“汪辜会谈”
C.恢复对香港行使主权	        D.恢复对澳门行使主权
24.2004年，中共十六届四中全会提出的战略任务是
A.建立社会主义市场经济体制	B.构建社会主义和谐社会
C.建设社会主义新农村	D.全面建成小康社会
25.2005年，第十届全国人民代表大会第三次会议通过的法律是
A.《香港特别行政区基本法》	B.《国家安全法》
C.《澳门特别行政区基本法》	D.《反分裂国家法》`,
			answer: 'ACDCABCDABABBCBCACCDCDDBD'
		},
		{
			exam: `1．在中国近代史上，人民群众第一次大规模的反侵略武装斗争是 
  A．三元里人民的抗英斗争          B．太平天国抗击洋枪队的斗争
  C．台湾人民的抗日斗争            D．义和团抗击八国联军的斗争
2．19世纪60年代，洋务派最早从事的洋务事业是 
  A．兴办民用工                    B．兴办军用工业
  C．派遣留学生                    D．创立新式学堂
3．1898年，严复翻译出版的《天演论》所宣传的思想是 
  A．师夷长技以制夷                B．中学为体、西学为用        
C．振兴中华		               D．物竞天择、适者生存
4.戊戌维新时期，谭翤同撰写的宣传变法主张的著作是
  A．新学伪经考                    B．变法通义
  C．仁学                          D．日本变政考
5．1911年夏，湖北、湖南、广东和四川爆发的民众运动是 
  A．拒俄运动     				   B．广东水师
  C．立宪运动					   D．保路运动
6．在俄国十月革命影响下，率先在中国举起马克思主义旗帜的是 
  A．陈独秀        B．李大钊       C．李达      D．毛泽东
7．第一次国共合作的政治基础是
A.三民主义                      B．新三民主义
C．新民主主义                    D．社会主义
8．1928年12月，在东北宣布“服从民国政府，改易旗帜”的是
  A．张学良        B．张作霖       C．冯国璋    D．冯玉祥
9．中国共产党独立领导革命战争、创建人民军队的开端是 
  A．南昌起义      B．秋收起义     C．广州起义  D．白色起义
10．1931年，日本帝国主义制造的侵略中国东北的事变是 
  A．九一八事变    B．一二八事变   C．七七事变  D．八一三事变
11．1935年12月，中国共产党确定抗日民族统一战线政策的会议是
  A．遵义会议      B．瓦窑堡会议   C．洛川会议   D．晋绥干部会议
12．1938年3月，国民党军队在抗日战争正面战场上取得胜利的战役是 
  A．台儿庄战役    B．桂南战役     C．枣宜战役   D．中条山战役
13．1938年5月，毛泽东发表的系统阐述抗日战争特点、前途和发展规律的著作是
  A．论反对日本帝国主义的策略      B．论持久战         
C．论政策				           D．论联合政府
14．在抗日战争中为国捐躯的八路军副参谋长是 
  A．彭雪枫          B．赵尚志     C．杨靖宇     D．左权
15．1945年8月。发表《对日寇最后一战》申明的是
  A．朱德            B．周恩来      C．彭德怀    D．毛泽东
16．1946年6月，国民党军队挑起全面内战的起点是
  A．重点进攻陕甘岭边区    			B．重点进攻山东解放区    
C．大举围攻中原解放区			    D．大举围攻东北解放区
17．我国西藏实现和平解放的时间是
  A．1949年10月                   B．1950年10月
  C．1951年10月		            D．1952年10月
18．1951年底到1952年春，中国共产党在党政机关工作人员中开展的运动是 
  A．肃反运动    					B．整风、整党运动    
C．三反运动					    D．五反运动
19．中国共产党在过渡时期总路线的主体是逐步实现 
  A．国家的社会主义工业化        	B．对个体农业的社会主义改造   
C．对个体手工业的社会主义改造     D．对资本主义工商业的社会主义改造
20．新中国开始实施发展国民经济第一个五年计划的时间是 
  A．1950年           B．1951年    C．1952年     D．1953年
21．我国农业社会主义改造中，具有完全社会主义性质的经济组织形式是 
  A．变工队			                B．互助组
  C．初级农业生产合作社             D．高级农业生产合作社
22．我国对资本主义工商业进行社会主义改造的基本政策是 
  A．无偿没收         B．有偿征用   C．和平贩卖    D．限制发展
23．毛泽东《论十大关系》报告所围绕的基本方针是 
  A．独立自主，艰苦创业                     
B．调动一切积极因素，为社会主义事业服务
  C．走中国特色社会主义道路                     
D．自力更生为主，争取外援为辅
24．1990年，邓小平提出的关于中国农业改革与发展的思想是
  A．“三个主体，三个补充”               B.“三步走”
  C．“两个飞跃”		                 D．“两个大局”
25．2001年，中国对外开放进入一个新阶段的标志是
  A．开放十四个沿海港口城市
  B．设立南海经济特区 
  C．开发和开放上海浦东新区
  D．加入世界贸易组织 `,
			answer: 'ABDCDBBAAABABDDCCCADDCBCD'
		},
		{
			exam: `1．在19世纪末西方列强瓜分中国的狂潮中，提出“门户开放”政策的国家是
  A．美国         B．日本          C．俄国          D．德国
2．1843年，魏源在《海国图志》中提出的思想主张是
  A．中学为体，西学为用            B．师夷长技以制夷
  C．物竞天择，适者生存            D．维新变法，救亡图存
3．太平天国后期，提出《资政新篇》这一具有资本主义色彩改革方案的人是
  A．洪秀全      B．杨秀清         C．洪仁歼        D．石达开
4.1861年，清政府设立的综理洋务的中央机关是
  A．江南制造总局                  B．京师同文馆
  C．总理各国事务衙门              D．外务部
5．到l9世纪90年代，洋务派建成的新式海军中的主力是
  A．北洋水师     B．广东水师      C．南洋水师     D．福建水师
6．戊戌维新时期，维新派在上海创办的影响较大的报刊是
  A．《万国公报》    B．《国闻报》   C．《湘报》      D．《时务报》
7．在中国近代史上，资产阶级思想与封建主义思想的第一次正面交锋是
  A.维新派与守旧派的论战          B．洋务派与顽固派的论战
C．洋务派与维新派的论战          D．革命派与改良派的论战
8．20世纪初，邹容发表的宣传民主革命思想的著作是
  A．《驳康有为论革命书》           B．《革命军》
  C．《警世钟》                     D．《猛回头》
9．近代中国历史上第一个全国性的资产阶级革命政党是
  A．兴中会      B．中国同盟会     C．中华革命党     D．中国国民党
10．第一次国共合作建立后，全国范围大革命风暴兴起的标志是
  A．护国战争    B．护法运动       C．北伐战争       D．五卅运动
11．1930年8月，国民党民主人士邓演达领导成立的中间党派是
  A．中国青年党                    B．中国民主同盟
  C．中国国民党临时行动委员会      D．中华职业教育社
12．1931年11月，当选为中华苏维埃共和国中央执行委员会主席的是
  A．毛泽东       B．周恩来           C．项英          D．王稼祥
13．1935年1月，中国共产党召开的具有历史转折意义的会议是
  A．八七会议     B．古田会议         C．遵义会议      D．洛川会议
14．毛泽东在《论持久战》中指出，中国抗日战争取得胜利最关键的阶段是
  A．战略防御阶段    B．战略相持阶段    C．战略反攻阶段     D．战略决战阶段
15．1946年6月，国民党当局制造的镇压上海人民团体联合会请愿团的惨案是
  A．二七惨案        B．校场口惨案      C．下关惨案         D．确山惨案
16．1947年在国统区爆发的大规模的爱国学生运动是
  A．一二·九运动    B．一二·一运动    C．一二·三O运动   D．五·二0运动
17．1947年10月发布的《中国人民解放军总部宣言》正式提出的行动口号是
  A．和平、民主、团结                   B．向北发展、向南防御
  C．打倒蒋介石、解放全中国             D．打过长江去、解放全中国
18．新中国成立初期，社会主义国营经济建立的主要途径是
  A．没收官僚资本    B．征用外国资本    C．赎买民族资本    D．合并公营资本
19．1962年初，中共中央为总结经验教训、明确工作方向召开的会议是
  A．南宁会议        B．“七千人大会”   C．成都会议        D．武昌会议
20．新中国第一颗人造地球卫星发射成功的时间是
  A．1964年10月    B．1966年10月     C．1967年10月    D．1970年4月
21．1979年元旦，全国人大常委会发表的重要文献是
  A．《关于台湾回归祖国实现和平统一的方针政策》
  B．《告台湾同胞书》
  C．《为促进祖国统一大业的完成而继续奋斗》
  D．《反国家分裂法》
22．中国共产党第一次完整地概括社会主义初级阶段基本路线的会议是
  A．中共十三大      B．中共十四大      C．中共十五大      D．中共十六大
23．中国恢复对澳门行使主权的时间是
  A．1997年7月1日                     B．1997年l2月20
  C．1999年7月1日                     D．1999年l2月20
24．2013年11月，作出《关于全面深化改革若干重大问题的决定》的会议是
  A．中共十八届一中全会                  B.中共十八届二中全会
  C．中共十八届三中全会                  D．中共十八届四中全会
25．20世纪以来，中国经历的第三次历史性巨变是
  A．辛亥革命，推翻统治中国几千年的君主专制制度
  B．五四运动，揭开新民主主义革命的序幕
  C．中华人民共和国的成立和社会主义制度的建立
  D．改革开放，为实现社会主义现代化而奋斗`,
			answer: 'ABCCADABBDCACBCDCABDBADCD'
		},
		{
			exam: `1．在中国近代史上，人民群众第一次大规模反侵略的武装斗争是
    A．三元里人民的抗英斗争               B．太平天国抗击洋枪队的斗争
    C．台湾人民的抗日斗争                 D．义和团抗击八国联军的斗争
  2．19世纪末，在帝国主义列强瓜分中国的狂潮中提出“门户开放”政策的国家是
    A．美国            B．日本            C．俄国            D．德国
  3．旧民主主义革命时期中国反侵略斗争失败的根本原因是
    A．经济技术落后    B．社会制度腐败    C．思想文化保守    D．军事指挥失误
  4．1843年，魏源在《海国图志》中提出的思想主张是
    A．中学为体，西学为用               B．师夷长技以制夷
    C．物竞天择，适者生存               D．维新变法
  5．太平天国农民起义爆发的时问是
    A．1851年        B．1853年         C．1856年         D．1864年
  6．太平天国后期，提出《资政新篇》这一具有资本主义色彩改革方案的是
    A．洪秀全         B．杨秀清         C．洪仁歼         D．石达开
  7．1861年，清政府设立的综理洋务的中央机关是
    A．江南制造总局                     B．京师同文馆
    C．总理各国事务衙门                 D．外务部
8．19世纪60年代，洋务派最早从事的洋务事业是
  A．兴办民用工业    B．创立新式学堂    C．派遣留学生     D．兴办军用工业
9．1894年，孙中山在檀香山建立的资产阶级革命组织是
  A．兴中会          B．华兴会          C．光复会         D．岳王会
10．1904年至l905年，为争夺在华利益而在中国东北进行战争的帝国主义国家是
  A．美国与俄国      B．美国与英国      C．英国与日本     D．日本与俄国
11．20世纪初，邹容发表的号召人民推翻清朝统治、建立“中华共和国”的著作是
  A．《驳康有为论革命书》                B．《革命军》
  C．《警世钟》                          D．《猛回头》
12．1905年至l907年，资产阶级革命派与改良派论战的焦点是
  A．要不要打倒列强                     B．要不要推翻帝制，实行共和
  C．要不要以革命手段推翻清政府         D．要不要废科举，兴学堂
13．1918年5月，鲁迅发表的第一篇白话文小说是
  A．《阿Q正传》    B．《狂人日记》      C．《药》          D．《祝福》
14．标志着中国新民主主义革命开端的运动是
  A．新文化运动     B．五四运动         C．保路运动       D．五卅运动
15．1919年，发表《我的马克思主义观》一文的是  
  A．陈独秀         B．李大钊           C．蔡和森         D．杨匏安
16．1920年11月，中国共产党早期组织领导的第一个产业工会是
  A．上海机器工会                       B．北京长辛店工人俱乐部
  C．中国劳动组合书记部                 D．中华全国总工会
17．1935年l2月，中共中央召开的确定抗日民族统一战线政策的会议是
  A．瓦窑堡会议                         B．洛川会议
  C．中共六届六中全会                   D．中共六届七中全会
18．1937年，日本帝国主义发动全面侵华战争的标志是
  A．九一八事变      B．一·二八事变    C．华北事变        D．卢沟桥事变
19．1940年，在枣宜会战中以身殉国的国民党爱国将领是
  A．佟麟阁          B．赵登禹          C．谢晋元          D．张自忠
20．中国共产党开展的延安整风运动最主要的任务是
  A．反对主观主义    B．反对宗派主义    C．反对官僚主义    D．反对党八股
21．1946年，中共中央决定将减租减息政策改为实现“耕者有其田”政策的文件是
  A．《井冈山土地法》
  B．《兴国土地法》
  C．《关于清算、减租及土地问题的指示》
  D．《中国土地法大纲》
22．1947年6月，晋冀鲁豫野战军千里跃进大别山，揭开了人民解放战争
  A．战略防御的序幕  B．战略转移的序幕  C．战略进攻的序幕  D．战略决战的序幕
23．1947年，国民党宪警制造的镇压爱国学生运动的惨案是
  A．五卅惨案        B．校场口惨案      C．下关惨案        D.五二O惨案
24．1948年4月，毛泽东完整提出新民主主义革命总路线的著作是
  A．《新民主主义论》                    B．《目前形势和我们的任务》
  C．《在晋绥干部会议上的讲话》          D．《将革命进行到底》
25．1950年6月，中共七届三中全会确定的中心任务是
  A．迅速消灭国民党残余势力             B．完成新解放区土地改革
  C．统一全国财政经济工作               D．争取国家财政经济状况的基本好转
26．1951年底到1952年春，中国共产党在党政机关工作人员中开展的运动是
  A．肃反运动        B．整风、整党运动  C．“三反”运动    D．“五反”运动
27．1988年，中共中央和国务院决定建立的经济特区是
  A．珠海经济特区    B．汕头经济特区    C．厦门经济特区    D．海南经济特区
28．1990年，邓小平提出的关于中国农业改革与发展的思想是
  A．“三个主体，三个补充”        B．“三步走”    
  C．“两个飞跃”                  D．“两个大局”
29．中国恢复对澳门行使主权的时间是
  A．1997年7月l             B．1997年l2月20
  C．1999年7月1日                D．1999年12月20日
30．中共十七大报告指出，我国社会主义现代化建设新时期最鲜明的特点是
  A.与时俱进       B．快速发展     C．改革开放      D．以人为本`,
			answer: 'AABBACCDADBCBBBAADDACCDCDCDCDC'
		}
	]
];
